src/10_3_20_postgres.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            666330
        write:                           189361
        other:                           95689
        total:                           951380
    transactions:                        47335  (2366.36 per sec.)
    queries:                             951380 (47561.15 per sec.)
    ignored errors:                      260    (13.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0024s
    total number of events:              47335

Latency (ms):
         min:                                    1.06
         avg:                                    4.22
         max:                                   17.65
         95th percentile:                        7.04
         sum:                               199890.54

Threads fairness:
    events (avg/stddev):           4733.5000/16.21
    execution time (avg/stddev):   19.9891/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            475720
        write:                           134686
        other:                           68593
        total:                           678999
    transactions:                        33681  (1683.64 per sec.)
    queries:                             678999 (33941.61 per sec.)
    ignored errors:                      299    (14.95 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0033s
    total number of events:              33681

Latency (ms):
         min:                                    1.14
         avg:                                    5.94
         max:                                 1096.18
         95th percentile:                        8.13
         sum:                               199924.98

Threads fairness:
    events (avg/stddev):           3368.1000/30.06
    execution time (avg/stddev):   19.9925/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            745514
        write:                           211840
        other:                           107078
        total:                           1064432
    transactions:                        52957  (2646.97 per sec.)
    queries:                             1064432 (53203.95 per sec.)
    ignored errors:                      294    (14.70 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0057s
    total number of events:              52957

Latency (ms):
         min:                                    1.05
         avg:                                    3.77
         max:                                   20.64
         95th percentile:                        6.43
         sum:                               199910.84

Threads fairness:
    events (avg/stddev):           5295.7000/17.71
    execution time (avg/stddev):   19.9911/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            511980
        write:                           144841
        other:                           73885
        total:                           730706
    transactions:                        36223  (1810.39 per sec.)
    queries:                             730706 (36519.98 per sec.)
    ignored errors:                      347    (17.34 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0063s
    total number of events:              36223

Latency (ms):
         min:                                    1.03
         avg:                                    5.52
         max:                                   29.63
         95th percentile:                        7.98
         sum:                               199932.46

Threads fairness:
    events (avg/stddev):           3622.3000/9.93
    execution time (avg/stddev):   19.9932/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            482048
        write:                           136357
        other:                           69558
        total:                           687963
    transactions:                        34094  (1703.99 per sec.)
    queries:                             687963 (34383.83 per sec.)
    ignored errors:                      338    (16.89 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0058s
    total number of events:              34094

Latency (ms):
         min:                                    1.04
         avg:                                    5.86
         max:                                 1022.92
         95th percentile:                        8.13
         sum:                               199928.64

Threads fairness:
    events (avg/stddev):           3409.4000/13.77
    execution time (avg/stddev):   19.9929/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            663936
        write:                           188604
        other:                           95408
        total:                           947948
    transactions:                        47159  (2356.95 per sec.)
    queries:                             947948 (47377.33 per sec.)
    ignored errors:                      265    (13.24 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0054s
    total number of events:              47159

Latency (ms):
         min:                                    1.05
         avg:                                    4.24
         max:                                 1022.80
         95th percentile:                        6.55
         sum:                               199913.05

Threads fairness:
    events (avg/stddev):           4715.9000/27.33
    execution time (avg/stddev):   19.9913/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            515004
        write:                           145853
        other:                           74228
        total:                           735085
    transactions:                        36469  (1822.62 per sec.)
    queries:                             735085 (36737.50 per sec.)
    ignored errors:                      317    (15.84 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0065s
    total number of events:              36469

Latency (ms):
         min:                                    1.14
         avg:                                    5.48
         max:                                 1023.63
         95th percentile:                        7.98
         sum:                               199933.78

Threads fairness:
    events (avg/stddev):           3646.9000/11.80
    execution time (avg/stddev):   19.9934/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            543900
        write:                           154112
        other:                           78366
        total:                           776378
    transactions:                        38539  (1926.13 per sec.)
    queries:                             776378 (38802.29 per sec.)
    ignored errors:                      311    (15.54 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0064s
    total number of events:              38539

Latency (ms):
         min:                                    1.11
         avg:                                    5.19
         max:                                   19.48
         95th percentile:                        7.98
         sum:                               199927.46

Threads fairness:
    events (avg/stddev):           3853.9000/9.73
    execution time (avg/stddev):   19.9927/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            584206
        write:                           165742
        other:                           84089
        total:                           834037
    transactions:                        41458  (2072.60 per sec.)
    queries:                             834037 (41695.82 per sec.)
    ignored errors:                      271    (13.55 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0021s
    total number of events:              41458

Latency (ms):
         min:                                    1.10
         avg:                                    4.82
         max:                                 1020.07
         95th percentile:                        6.91
         sum:                               199902.18

Threads fairness:
    events (avg/stddev):           4145.8000/11.28
    execution time (avg/stddev):   19.9902/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            456988
        write:                           129163
        other:                           65972
        total:                           652123
    transactions:                        32285  (1555.56 per sec.)
    queries:                             652123 (31420.58 per sec.)
    ignored errors:                      357    (17.20 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.7526s
    total number of events:              32285

Latency (ms):
         min:                                    1.08
         avg:                                    6.42
         max:                                 1021.52
         95th percentile:                        8.13
         sum:                               207357.94

Threads fairness:
    events (avg/stddev):           3228.5000/21.80
    execution time (avg/stddev):   20.7358/0.00